In [2]:
import pandas as pd
import os

In [51]:
df = pd.read_csv("Data/vehicle_collisions.csv")

In [4]:
df1 = df[['DATE','BOROUGH']]

In [5]:
df1.head()

     DATE   BOROUGH
0  1/1/15    QUEENS
1  1/1/15       NaN
2  1/1/15  BROOKLYN
3  1/1/15  BROOKLYN
4  1/1/15       NaN

In [6]:
df1['DATE']=pd.to_datetime(df1['DATE'])

C:\Users\vs\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':

In [13]:
import calendar
df1['MONTH']=df1['DATE'].dt.month.apply(lambda x: calendar.month_abbr[x])

C:\Users\vs\Anaconda3\lib\site-packages\ipykernel\__main__.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  from ipykernel import kernelapp as app

In [20]:
df1['YEAR']=df1['DATE'].dt.year

C:\Users\vs\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':

In [23]:
df1.head()

        DATE   BOROUGH MONTH  YEAR
0 2015-01-01    QUEENS   Jan  2015
1 2015-01-01       NaN   Jan  2015
2 2015-01-01  BROOKLYN   Jan  2015
3 2015-01-01  BROOKLYN   Jan  2015
4 2015-01-01       NaN   Jan  2015

In [24]:
df1=df1[df1['YEAR']==2016]

In [46]:
df_total=df1.groupby('MONTH',sort=False).count().reset_index()
df_total1=df_total[['MONTH',"DATE"]]

In [49]:
df_total1=df_total1.rename(columns={'DATE':'TOTAL_COUNT'})

In [50]:
df_total1

   MONTH  TOTAL_COUNT
0    Jan        18101
1    Feb        15985
2    Mar        18471
3    Apr        18331
4    May        20052
5    Jun        19433
6    Jul        19867
7    Aug        19678
8    Sep        19492
9    Oct        19666
10   Nov        19315
11   Dec        19214

In [19]:
#df1 = df.loc[df['BOROUGH'] == 'MANHATTAN']

In [52]:
deeff = df1.loc[df1['BOROUGH'] == 'MANHATTAN']

In [53]:
deeff.head()

             DATE    BOROUGH MONTH  YEAR
217539 2016-01-01  MANHATTAN   Jan  2016
217541 2016-01-01  MANHATTAN   Jan  2016
217542 2016-01-01  MANHATTAN   Jan  2016
217543 2016-01-01  MANHATTAN   Jan  2016
217549 2016-01-01  MANHATTAN   Jan  2016

In [55]:
deeff_total=deeff.groupby('MONTH',sort=False).count().reset_index()
deeff_total1=deeff_total[['MONTH',"DATE"]]

In [57]:
deeff_total1.head()

  MONTH  DATE
0   Jan  3178
1   Feb  3195
2   Mar  3479
3   Apr  3540
4   May  3432

In [60]:
deeff_total1=deeff_total1.rename(columns={'TOTAL_COUNT':'MANHATTAN_COUNT'})

In [61]:
deeff_total1.head()

  MONTH  MANHATTAN_COUNT
0   Jan             3178
1   Feb             3195
2   Mar             3479
3   Apr             3540
4   May             3432

In [62]:
final_df = df_total1.merge(deeff_total1)

In [64]:
final_df['PERCENTAGE']=(final_df['MANHATTAN_COUNT']/final_df['TOTAL_COUNT'])*100

In [65]:
final_df.head()

  MONTH  TOTAL_COUNT  MANHATTAN_COUNT  PERCENTAGE
0   Jan        18101             3178   17.557041
1   Feb        15985             3195   19.987488
2   Mar        18471             3479   18.834930
3   Apr        18331             3540   19.311549
4   May        20052             3432   17.115500

In [67]:
final_df.to_csv('Output/Question1_Part1.csv',index=False)